import java.util.Random;

public class MK {
    Random random = new Random();
    public Integer PC_1=0,PC_2=0;

    public Integer Collision(){
        /**
         * Δημιουργία δύο μεταβλητών, όπου οι τιμές τους είναι είτε 0 είτε 1.
         * Οι τιμές αυτές δίνονται με ψευδοτυχαίο τρόπο από την rand.
         */
        boolean flag=true;
        PC_1= random.nextInt(2 - 0) + 0;
        PC_2= random.nextInt(2 - 0) + 0;
        /**
         * Η τιμή 1 είναι για την μετάδοση και η τιμή 0 είναι όταν δεν θέλει να μεταδώσει ο υπολογιστής.
         * Στην περίπτωση που και οι δύο τιμές είναι 1, έχω collision, αφού και οι δύο υπολογιστές θέλουν να μεταδώσουν.
         * Σε αυτήν την περίπτωση κανένας υπολογιστής δεν μεταδίδει και γίνεται εμφάνιση του μηνύματος που δόθηκε απο την εκφώνηση.
         * Στην περίπτωση που μία από τις δύο τιμές είναι 1 και η άλλη 0, ο υπολογιστής με την τιμή 1 μεταδίδει με επιτυχία.
         * Στην περίπτωση που έχουν και οι δύο την τιμή 0 κανένας από τους δύο υπολογιστές δεν θέλει να μεταδώσει.
         */
        if (PC_1==PC_2 && PC_1==1){
            flag=false;
            System.out.println("Stations 1 & 2 are trying to transmit COLLISION");
        }else{
            if (PC_1==1 && flag){
                return 1; //μεταδίδει ο πρώτος υπολογιστής από το ζεύγος.
            }
            if (PC_2==1 && flag){
                return 2; //μεταδίδει ο δεύτερος υπολογιστής απο το ζεύγος.
            }
        }
        return 0; //δεν μεταδίδει κανένας υπολογιστής είτε λόγω collision είτε επειδή κανένας δεν θέλει.
    }
}
